In [67]:
import numpy as np
import pandas as pd

# SERIES

In [5]:
student_names =  ['awais','kashif','zahid','ahmed']
student_scores = [60,70,80,90]
student_scores_array = np.array(student_scores)
student_name_scores_dict = {'awais': 60 , 'kashif': 70, 'zahid': 80, 'ahmed':90}

In [6]:
pd.Series(student_scores)

0    60
1    70
2    80
3    90
dtype: int64

In [8]:
ser1 = pd.Series(student_scores,student_names)

In [9]:
ser1

awais     60
kashif    70
zahid     80
ahmed     90
dtype: int64

In [10]:
ser2 = pd.Series(student_scores_array)

In [11]:
ser2

0    60
1    70
2    80
3    90
dtype: int64

In [12]:
ser3 = pd.Series(student_name_scores_dict)

In [13]:
ser3

awais     60
kashif    70
zahid     80
ahmed     90
dtype: int64

In [15]:
int(ser3['awais'])

60

In [16]:
machine_Learning_result = pd.Series([40,50,60,30,95],['awais','kashif','kamran','ahmed','zahoor'])

In [17]:
machine_Learning_result

awais     40
kashif    50
kamran    60
ahmed     30
zahoor    95
dtype: int64

In [19]:
prgramming_result = ser3

In [20]:
prgramming_result

awais     60
kashif    70
zahid     80
ahmed     90
dtype: int64

In [21]:
machine_Learning_result + prgramming_result

ahmed     120.0
awais     100.0
kamran      NaN
kashif    120.0
zahid       NaN
zahoor      NaN
dtype: float64

# DATA FRAME

In [22]:
data = np.random.randint(1,100,(5,4))
data

array([[10, 90, 93,  7],
       [73,  9,  5, 81],
       [22, 40, 55, 78],
       [30, 58, 94,  2],
       [83, 38, 37, 14]], dtype=int32)

In [23]:
df = pd.DataFrame(data,['awais','kashif','zahid','ahmed','zahoor'],['PF','OOP','DSA','ML'])

# Accessing Columns in Dataframe

In [25]:
df['PF']

awais     10
kashif    73
zahid     22
ahmed     30
zahoor    83
Name: PF, dtype: int32

In [26]:
df[['PF','OOP']]

        PF  OOP
awais   10   90
kashif  73    9
zahid   22   40
ahmed   30   58
zahoor  83   38

# Accessing Rows in Dataframes

In [27]:
df.loc['awais']

PF     10
OOP    90
DSA    93
ML      7
Name: awais, dtype: int32

In [29]:
df.iloc[1]

PF     73
OOP     9
DSA     5
ML     81
Name: kashif, dtype: int32

In [30]:
df

        PF  OOP  DSA  ML
awais   10   90   93   7
kashif  73    9    5  81
zahid   22   40   55  78
ahmed   30   58   94   2
zahoor  83   38   37  14

In [31]:
df.columns

Index(['PF', 'OOP', 'DSA', 'ML'], dtype='object')

In [32]:
df.index

Index(['awais', 'kashif', 'zahid', 'ahmed', 'zahoor'], dtype='object')

# Add new Columns - Derived Feature

In [34]:
df['Total'] = df['PF'] + df['OOP'] + df['DSA'] + df['ML']

In [35]:
df

        PF  OOP  DSA  ML  Total
awais   10   90   93   7    200
kashif  73    9    5  81    168
zahid   22   40   55  78    195
ahmed   30   58   94   2    184
zahoor  83   38   37  14    172

In [37]:
df.describe()

            PF        OOP        DSA        ML       Total
count   5.0000   5.000000   5.000000   5.00000    5.000000
mean   43.6000  47.000000  56.800000  36.40000  183.800000
std    32.3929  29.765752  37.989472  39.58914   13.935566
min    10.0000   9.000000   5.000000   2.00000  168.000000
25%    22.0000  38.000000  37.000000   7.00000  172.000000
50%    30.0000  40.000000  55.000000  14.00000  184.000000
75%    73.0000  58.000000  93.000000  78.00000  195.000000
max    83.0000  90.000000  94.000000  81.00000  200.000000

In [38]:
df

        PF  OOP  DSA  ML  Total
awais   10   90   93   7    200
kashif  73    9    5  81    168
zahid   22   40   55  78    195
ahmed   30   58   94   2    184
zahoor  83   38   37  14    172

# Drop a column

In [45]:
df.drop('Total',axis=1,inplace=True)

# Condtional Selection

In [49]:
df[df['PF'] > 40]

        PF  OOP  DSA  ML
kashif  73    9    5  81
zahoor  83   38   37  14

# Dealing with Missing Values in Data

In [50]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [51]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [53]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [55]:
df.fillna("VALUE")

       A      B  C
0    1.0    5.0  1
1    2.0  VALUE  2
2  VALUE  VALUE  3

In [57]:
df.fillna(df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

# Reading Data from CSV

In [62]:
df = pd.read_csv("C:\\Users\\Muhammad Awais\\04-Pandas-Exercises\\Salaries.csv")

In [63]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [65]:
type(df)

pandas.core.frame.DataFrame